-- Время перехода до точки (мин.). Запас и аудиогид считаются в веб-приложении.
SET NOCOUNT ON;
GO

-- Маршрут 1: Прогулка по окрестностям Сенной площади
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 7  WHERE [id_точки_маршрута] = 2;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 3  WHERE [id_точки_маршрута] = 3;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 5  WHERE [id_точки_маршрута] = 4;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 1  WHERE [id_точки_маршрута] = 5;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 4  WHERE [id_точки_маршрута] = 6;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 3  WHERE [id_точки_маршрута] = 7;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 3  WHERE [id_точки_маршрута] = 8;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 3  WHERE [id_точки_маршрута] = 9;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 1  WHERE [id_точки_маршрута] = 10;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 5  WHERE [id_точки_маршрута] = 11;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 4  WHERE [id_точки_маршрута] = 12;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 8  WHERE [id_точки_маршрута] = 13;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 4  WHERE [id_точки_маршрута] = 14;
GO

-- Маршрут 2: Навстречу Балтике
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 4  WHERE [id_точки_маршрута] = 15;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 5  WHERE [id_точки_маршрута] = 16;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 2  WHERE [id_точки_маршрута] = 17;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 5  WHERE [id_точки_маршрута] = 18;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 2  WHERE [id_точки_маршрута] = 19;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 6  WHERE [id_точки_маршрута] = 20;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 8  WHERE [id_точки_маршрута] = 21;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 8  WHERE [id_точки_маршрута] = 22;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 13 WHERE [id_точки_маршрута] = 23;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 2  WHERE [id_точки_маршрута] = 24;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 2  WHERE [id_точки_маршрута] = 25;
GO

-- Маршрут 3: От искусства к науке
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 1  WHERE [id_точки_маршрута] = 26;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 6  WHERE [id_точки_маршрута] = 27;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 4  WHERE [id_точки_маршрута] = 28;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 1  WHERE [id_точки_маршрута] = 29;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 5  WHERE [id_точки_маршрута] = 30;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 5  WHERE [id_точки_маршрута] = 31;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 5  WHERE [id_точки_маршрута] = 32;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 7  WHERE [id_точки_маршрута] = 33;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 2  WHERE [id_точки_маршрута] = 34;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 9  WHERE [id_точки_маршрута] = 35;
GO

-- Маршрут 4: Таинственная Коломна
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 6  WHERE [id_точки_маршрута] = 36;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 1  WHERE [id_точки_маршрута] = 37;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 3  WHERE [id_точки_маршрута] = 38;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 4  WHERE [id_точки_маршрута] = 39;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 8  WHERE [id_точки_маршрута] = 40;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 4  WHERE [id_точки_маршрута] = 41;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 3  WHERE [id_точки_маршрута] = 42;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 4  WHERE [id_точки_маршрута] = 43;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 4  WHERE [id_точки_маршрута] = 44;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 7  WHERE [id_точки_маршрута] = 45;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 2  WHERE [id_точки_маршрута] = 46;
GO

-- Маршрут 5: Променад по линиям Васильевского острова
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 5  WHERE [id_точки_маршрута] = 47;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 4  WHERE [id_точки_маршрута] = 48;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 10 WHERE [id_точки_маршрута] = 49;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 3  WHERE [id_точки_маршрута] = 50;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 3  WHERE [id_точки_маршрута] = 51;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 6  WHERE [id_точки_маршрута] = 52;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 3  WHERE [id_точки_маршрута] = 53;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 3  WHERE [id_точки_маршрута] = 54;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 2  WHERE [id_точки_маршрута] = 55;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 3  WHERE [id_точки_маршрута] = 56;
GO

-- Маршрут 6: к стрелке Васильевского острова
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 7  WHERE [id_точки_маршрута] = 57;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 11 WHERE [id_точки_маршрута] = 58;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 2  WHERE [id_точки_маршрута] = 59;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 3  WHERE [id_точки_маршрута] = 60;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 3  WHERE [id_точки_маршрута] = 61;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 3  WHERE [id_точки_маршрута] = 62;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 3  WHERE [id_точки_маршрута] = 63;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 2  WHERE [id_точки_маршрута] = 64;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 4  WHERE [id_точки_маршрута] = 65;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 4  WHERE [id_точки_маршрута] = 66;
GO

-- Маршрут 7: Парадный Петербург
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 5  WHERE [id_точки_маршрута] = 67;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 5  WHERE [id_точки_маршрута] = 68;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 3  WHERE [id_точки_маршрута] = 69;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 3  WHERE [id_точки_маршрута] = 70;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 2  WHERE [id_точки_маршрута] = 71;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 6  WHERE [id_точки_маршрута] = 72;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 2  WHERE [id_точки_маршрута] = 73;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 6  WHERE [id_точки_маршрута] = 74;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 3  WHERE [id_точки_маршрута] = 75;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 1  WHERE [id_точки_маршрута] = 76;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 4  WHERE [id_точки_маршрута] = 87;
GO

-- Маршрут 8: Путешествие по набережной Мойки
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 5  WHERE [id_точки_маршрута] = 77;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 1  WHERE [id_точки_маршрута] = 78;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 2  WHERE [id_точки_маршрута] = 79;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 6  WHERE [id_точки_маршрута] = 81;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 4  WHERE [id_точки_маршрута] = 82;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 5  WHERE [id_точки_маршрута] = 83;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 6  WHERE [id_точки_маршрута] = 84;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 2  WHERE [id_точки_маршрута] = 85;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 5  WHERE [id_точки_маршрута] = 86;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 4  WHERE [id_точки_маршрута] = 88;
UPDATE [точка_маршрута] SET [время_для_точки_мин] = 2  WHERE [id_точки_маршрута] = 89;
GO

PRINT N'Время переходов обновлено (маршруты 1–8).';
GO
