USE [guap_routes_db];

UPDATE [достопримечательность]
SET [описание] = N'Прямо напротив здания Консерватории находится знаменитый Мариинский театр. Современное здание на площади возвели в 1859–1860 годах по проекту архитектора Альберта Кавоса. Оно было посвящено Марии Александровне, супруге Александра II. Архитектор применил для своего времени передовую планировку: удлинённая сцена, просторная оркестровая яма, повышенные закулисные пространства и зал-подкова почти на полторы тысячи мест. Конструкцию неоднократно усиливали: после пожаров меняли перекрытия, вводили новое освещение, обновляли механизмы сценических подъёмников.

Именно на этой сцене шли первые постановки опер Глинки, Даргомыжского, Мусоргского, Бородина и Римского-Корсакова. Здесь впервые прозвучали «Пиковая дама», «Снегурочка», «Китеж». С театром связаны Шаляпин, Павлова, Уланова, Кшесинская и многие другие известные исполнители. После революции театр стал называться Государственным академическим театром оперы и балета. В блокаду часть коллектива отправили в эвакуацию, но в осаждённом городе продолжались концерты и спектакли. В 1944 году театру присвоили имя Кирова.

В ходе послевоенной реставрации театру вернули лепнину и росписи, модернизировала систему вентиляции и сценическое оборудование. Историческое название Мариинского театра было восстановлено в 1992 году. Сегодня помимо исторической сцены работают новая сцена и концертный зал. В учреждении есть собственные оркестр, хор, балетная труппа и производственные мастерские — от костюмерных до реквизиторских. Репертуар охватывает музыку от XVIII века до новейших сочинений. С конца 1980-х годов театр возглавляет Валерий Гергиев, при котором существенно выросло число премьер, гастролей и ежегодных постановок.'
WHERE [название] = N'Мариинский театр';

UPDATE [достопримечательность]
SET [описание] = N'Выйдя из университета, перейдите Мойку по Поцелуеву мосту и двигайтесь по улице Глинки к Театральной площади. Здесь расположена Санкт-Петербургская государственная консерватория имени Н.А. Римского-Корсакова. История консерватории начинается в 1862 году, когда по инициативе Антона Рубинштейна на основе классов Русского музыкального общества была создана первая в стране высшая школа, где будущие композиторы, инструменталисты, дирижёры и исполнители могли получать профессиональное образование.

Здание консерватории было создано в ходе перестройки Большого Каменного театра в 1891–1896 годах архитектором Владимиром Николя. При этом сохранились фундамент и части старых стен, а внутренние помещения приспособили для учебных классов и репетиционных залов. Здесь было все необходимое: отдельные аудитории для инструментальных и вокальных занятий, большие репетиционные помещения и классы для занятий композиции.

Среди первых её выпускников — Пётр Ильич Чайковский, завершивший обучение в 1865 году. В 1871 году к профессорскому составу консерватории присоединился Николай Андреевич Римский-Корсаков, заняв пост руководителя класса композиции и оркестровки. Во время работы в консерватории Римский-Корсаков совершенствовал собственные знания в области музыкальной теории и одновременно формировал новое поколение отечественных композиторов.

Перед главным фасадом установлен памятник Н.А. Римскому-Корсакову, открытый в 1952 году. Скульпторы В.Я. Боголюбов и В.И. Ингал совместно с архитектором М. А. Шепилевским создали бронзовый образ композитора, держащего в руках партитуру. Монумент внесён в список охраняемых объектов культурного наследия.'
WHERE [название] = N'Консерватория и памятник Римскому-Корсакову';
