USE [guap_routes_db];

UPDATE [достопримечательность]
SET [описание] = N'Этот дворец, который также называют Малым Михайловским, был построен для внука императора Николая I — великого князя Михаила Михайловича. Автором проекта выступил архитектор Максимилиан Егорович Месмахер, возведший здание в 1885–1891 годах в стиле неоренессанса.

Из-за небольшого размера участка архитектор оригинально расположил парадный двор-курдонер, обратив его в боковой Азовский переулок. Фасады здания, стилизованные под итальянский Ренессанс, богато украшены. Высокий цокольный этаж облицован финляндским гранитом, первый этаж — рустован, второй украшен сдвоенными полуколоннами, а третий — пилястрами.

Интерьеры дворца, оформленные в стилистике Ренессанса и барокко, так и не приняли своего хозяина. Из-за женитьбы на внучке А.С. Пушкина, Софье Меренберг, великий князь был выслан из России и поселился в Англии, не прожив в своей новой резиденции ни одного дня.

В 1909 году дворец был продан страховому обществу «Русский Ллойд», для которого в 1911 году архитектор П.К. Бергштрессер провел значительную перестройку. После революции 1917 года здание было национализировано и в разное время использовалось для различных нужд, включая банковские учреждения в 1990-е годы.'
WHERE [название] = N'Дворец великого князя Михаила Михайловича';

UPDATE [достопримечательность]
SET [описание] = N'Перед вами — Ново-Михайловский дворец, одна из трех великокняжеских резиденций, созданных знаменитым архитектором Андреем Ивановичем Штакеншнейдером. Он был построен в 1857–1862 годах для младшего сына императора Николая I, великого князя Михаила Николаевича, в связи с его женитьбой на баденской принцессе Цецилии Августе (в православии — Ольге Фёдоровне).

Штакеншнейдер мастерски соединил в облике дворца элементы разных стилей. В отделке фасадов и интерьеров он использовал мотивы барокко и рококо, переплетенные с приемами Ренессанса и «стиля Людовика XIV». В отделке фасадов принимали участие скульптор Давид Иенсен и живописец Михаил Зичи.

Уникальной особенностью дворца является сохраненная часть более старого здания — изогнутая стена, обращенная во двор. Это остатки дворца князя Алексея Михайловича Черкасского, построенного около 1740 года архитектором Петром Еропкиным. Эта криволинейная композиция фасада — уникальный для Петербурга образец, отражающий влияние итальянского барокко.

После смерти отца дворец перешел к его сыну, великому князю Николаю Михайловичу, который был известным историком и, к несчастью, разделил трагическую участь многих Романовых: в 1919 году он был расстрелян большевиками. После революции дворец был национализирован. Сегодня в его стенах располагаются научные учреждения Российской академии наук. В западном крыле находится Институт восточных рукописей РАН (ранее — Санкт-Петербургский филиал Института востоковедения), а также Институт истории материальной культуры РАН. При этом в здании сохранился ряд исторических интерьеров второй половины XIX — начала XX века, включая парадную лестницу, двусветный Зеленый (музыкальный) зал и кабинет князя Николая Михайловича.'
WHERE [название] = N'Ново-Михайловский дворец';
